app/Controllers/ArticleController.php

SELECT *
FROM `article`
WHERE   (
`full_name` LIKE '%Vaibhav yadav%' ESCAPE '!'
OR  `phone_number` LIKE '%Vaibhav yadav%' ESCAPE '!'
OR  `email_address` LIKE '%Vaibhav yadav%' ESCAPE '!'
 )
AND `status` != 0
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `article`
WHERE   (
`full_name` LIKE '%Vaibhav yadav%' ESCAPE '!'
OR  `phone_number` LIKE '%Vaibhav yadav%' ESCAPE '!'
OR  `email_address` LIKE '%Vaibhav yadav%' ESCAPE '!'
 )
AND `status` != 0
---
    public function list()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/');
        }

        $articleModel = new ArticleModel();


        $perPage = 10; // Number of entries per page

        // Search functionality
        $search = $this->request->getGet('search');
        if ($search) {
            $articleModel->groupStart()   // applied 'or' condition for the searching
                ->like('full_name', $search)
                ->orLike('phone_number', $search)
                ->orLike('email_address', $search)
                ->groupEnd();  // here the group ends
        }

        // Fetch paginated results
        $data['article'] = $articleModel->where('status !=', 0)
                                        ->paginate($perPage); //it  Automatically handles the current page