app/Controllers/Auth.php

    public function authenticate()
    {
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $userModel = new UserModel();

        $user = $userModel->where('username', $username)
                          ->where('password', $password)
                          ->first();
---
SELECT *
FROM `users`
WHERE `username` = 'Vaibhav yadav '
AND `password` = 'Vaibhav@1104'
 LIMIT 1