app/Controllers/Studentuploadcontroller.php

SELECT *
FROM `students`
WHERE `students`.`id` = '3'
---
    public function form($id = null)
    {
        $data = [];
        if ($id) {
            $data['student'] = $this->studentModel->find($id);

SELECT *
FROM `students`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `students`
SELECT *
FROM `students`
---
    public function list()
    {

        $perPage = 10;


        $search = $this->request->getGet('search');
        if ($search) {
            $this->studentModel->groupStart()
                ->like('student_name', $search)
                ->orLike('registration_no', $search)
                ->orLike('father_name', $search)
                ->groupEnd();
        }
        $data['students'] = $this->studentModel
            ->paginate($perPage);

        $data['pager'] = $this->studentModel->pager;

        $data['search'] = $search;



        $data['student'] = $this->studentModel->findAll();

DELETE FROM `students`
WHERE `id` IN ('3')
---
    public function delete($id)
    {
        if ($this->studentModel->delete($id)) {